DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BLE_ROM.h
typedef struct tag_rf_config
{
    uint8_t LLEMode;                  //!< BIT0   0=basic, 1=auto def@LLE_MODE_TYPE
                                      //!< BIT1   0=whitening on, 1=whitening off def@LLE_WHITENING_TYPE
                                      //!< BIT6   0=data channel(0-39)
                                      //!<        1=rf frequency (2400000kHz-2483500kHz)
                                      //!< BIT7   0=the first byte of the receive buffer is rssi
                                      //!<        1=the first byte of the receive buffer is package type
    uint8_t Channel;                  //!< rf channel(0-39)
    uint32_t Frequency;               //!< rf frequency (2400000kHz-2483500kHz)
    uint32_t accessAddress;           //!< access address,32bit PHY address
    uint32_t CRCInit;                 //!< crc initial value
    pfnRFStatusCB_t rfStatusCB;       //!< status call back
    uint32_t ChannelMap;              //!< indicating  Used and Unused data channels.Every channel is represented with a
                                      //!< bit positioned as per the data channel index,The LSB represents data channel index 0
    uint8_t Resv;
    uint8_t HeartPeriod;              //!< The heart package interval shall be an integer multiple of 100ms
    uint8_t HopPeriod;                //!< hop period( T=32n*RTC clock ),default is 8
    uint8_t HopIndex;                 //!< indicate the hopIncrement used in the data channel selection algorithm,default is 17
    uint8_t RxMaxlen;                 //!< Maximum data length received in rf-mode(default 251)
    uint8_t TxMaxlen;                 //!< Maximum data length transmit in rf-mode(default 251)
} rfConfig_t;

/* end define@RF-PHY */

/******************************************************************************/
#ifndef LIB_FLASH_BASE_ADDRESSS
#define LIB_FLASH_BASE_ADDRESSS   0x00010000
#endif
#define LIB_FLASH_MAX_SIZE        0x00020000
#define LIB_RAM_MAX_SIZE          0x00001000

#define RAM_BASE_ADDRESSS         0x20003800
#define UUID_BASE_ADDRESSS        (LIB_FLASH_BASE_ADDRESSS+0x08)
#define FUNCITON_BASE_ADDRESSS    (LIB_FLASH_BASE_ADDRESSS+0x34)

#define  BLE_LIB_UUID(n) ( UUID_BASE_ADDRESSS+n*2 )
#define  BLE_LIB_RAM_JT(n) (*(uint32_t*)( RAM_BASE_ADDRESSS+n*4 ))
#define  BLE_LIB_JT(n) (*(uint32_t*)( FUNCITON_BASE_ADDRESSS+n*4 ))
#define  VER_LIB  ((  const uint8_t*)      BLE_LIB_JT(0))

/*******************************************************************************
 * UUID defined
 */
/**
 * GATT Services
 */
#define  gapServiceUUID  ((const uint8_t*)         BLE_LIB_UUID(0)) 
#define  gattServiceUUID  ((const uint8_t*)        BLE_LIB_UUID(1))

/**
 * GATT Attribute Types
 */
#define  primaryServiceUUID  ((const uint8_t*)     BLE_LIB_UUID(2))
#define  secondaryServiceUUID  ((const uint8_t*)   BLE_LIB_UUID(3))
#define  includeUUID  ((const uint8_t*)            BLE_LIB_UUID(4))
#define  characterUUID  ((const uint8_t*)          BLE_LIB_UUID(5))

/**
 * GATT Characteristic Descriptors
 */
#define  charExtPropsUUID  ((const uint8_t*)       BLE_LIB_UUID(6))
#define  charUserDescUUID  ((const uint8_t*)       BLE_LIB_UUID(7))
#define  clientCharCfgUUID  ((const uint8_t*)      BLE_LIB_UUID(8))
#define  servCharCfgUUID  ((const uint8_t*)        BLE_LIB_UUID(9))
#define  charFormatUUID  ((const uint8_t*)         BLE_LIB_UUID(10))
#define  charAggFormatUUID  ((const uint8_t*)      BLE_LIB_UUID(11))
#define  validRangeUUID  ((const uint8_t*)         BLE_LIB_UUID(12))
#define  extReportRefUUID  ((const uint8_t*)       BLE_LIB_UUID(13))
#define  reportRefUUID  ((const uint8_t*)          BLE_LIB_UUID(14))

/**
 * GATT Characteristic Types
 */
#define  deviceNameUUID  ((const uint8_t*)         BLE_LIB_UUID(15))
#define  appearanceUUID  ((const uint8_t*)         BLE_LIB_UUID(16))
#define  periPrivacyFlagUUID  ((const uint8_t*)    BLE_LIB_UUID(17))
#define  reconnectAddrUUID  ((const uint8_t*)      BLE_LIB_UUID(18))
#define  periConnParamUUID  ((const uint8_t*)      BLE_LIB_UUID(19))
#define  serviceChangedUUID  ((const uint8_t*)     BLE_LIB_UUID(10))
#define  centAddrResUUID  ((const uint8_t*)        BLE_LIB_UUID(21))

/*******************************************************************************
 * PUBLIC FUNCTIONS
 */
#define    tmos_rand    ((  uint32_t  (*)  ( void  ))  BLE_LIB_JT(1)) // pseudo-random number
#define    tmos_memcmp  ((  BOOL (*)  ( const void *src1, const void *src2, uint32_t len ))  BLE_LIB_JT(2))  // TRUE - same, FALSE - different
#define    tmos_isbufset (( BOOL (*)  ( uint8_t *buf, uint8_t val, uint32_t len ))  BLE_LIB_JT(3)) // TRUE if all "val",FALSE otherwise
#define    tmos_strlen  ((  uint32_t  (*)  ( char *pString ))  BLE_LIB_JT(4))
#define    tmos_memset  ((  void (*)  ( void * pDst, uint8_t Value, uint32_t len ))  BLE_LIB_JT(5))
#define    tmos_memcpy  ((  void (*)  ( void *dst, const void *src, uint32_t len ))  BLE_LIB_JT(6))

/**
 * @brief   start a event immediately
 *
 * @param   taskID - task ID of event
 * @param   event - event value
 *
 * @return  0 - SUCCESS.
 */
#define    tmos_set_event  ((  bStatus_t  (*)  ( tmosTaskID taskID, tmosEvents event ))  BLE_LIB_JT(7))

/**
 * @brief   clear a event already timeout, cannot be used in it own event function.
 *
 * @param   taskID - task ID of event
 * @param   event - event value
 *
 * @return  0 - SUCCESS.
 */
#define    tmos_clear_event  ((  bStatus_t  (*)  ( tmosTaskID taskID, tmosEvents event ))  BLE_LIB_JT(8))

/**
 * @brief   start a event after period of time
 *
 * @param   taskID - task ID to set event for
 * @param   event - event to be notified with
 * @param   time - timeout value
 *
 * @return  TRUE,FALSE.
 */
#define    tmos_start_task  ((  BOOL  (*)  ( tmosTaskID taskID, tmosEvents event, tmosTimer time  ))  BLE_LIB_JT(9))

/**
 * @brief   This function is called to start a timer to expire in n system clock time.
 *          When the timer expires, the calling task will get the specified event
 *          and the timer will be reloaded with the timeout value.
 *
 * @param   taskID - task ID to set timer for
 * @param   event - event to be notified with
 * @param   time - timeout value
 *
 * @return  SUCCESS, or NO_TIMER_AVAIL.
 */
#define		 tmos_start_reload_task	((	bStatus_t	(*)	( tmosTaskID taskID, tmosEvents event, tmosTimer time  ))	BLE_LIB_JT(126) )

/**
 * @brief   stop a event
 *
 * @param   taskID - task ID of event
 * @param   event - event value
 *
 * @param   None.
 *
 * @return  SUCCESS.
 */
#define    tmos_stop_task  ((  bStatus_t  (*)  ( tmosTaskID taskID, tmosEvents event ))  BLE_LIB_JT(10))

/**
 * @brief   get last period of time for this event
 *
 * @param   taskID - task ID of event
 * @param   event - event value
 *
 * @return  the timer's tick count if found, zero otherwise.
 */
#define    tmos_get_task_timer   ((  tmosTimer  (*)  ( tmosTaskID taskID, tmosEvents event ))  BLE_LIB_JT(11))

/**
 * @brief   send msg to a task,callback events&SYS_EVENT_MSG
 *
 * @param   taskID - task ID of task need to send msg
 * @param  *msg_ptr - point of msg
 *
 * @return  SUCCESS, INVALID_TASK, INVALID_MSG_POINTER
 */
#define    tmos_msg_send  ((  bStatus_t  (*)  ( tmosTaskID taskID, uint8_t *msg_ptr ))  BLE_LIB_JT(12))

/**
 * @brief   delete a msg
 *
 * @param  *msg_ptr - point of msg
 *
 * @return  SUCCESS.
 */
#define    tmos_msg_deallocate  ((  bStatus_t  (*)  ( uint8_t *msg_ptr ))  BLE_LIB_JT(13))

/**
 * @brief   receive a msg
 *
 * @param   taskID  - task ID of task need to receive msg
 *
 * @return *uint8_t - message information or NULL if no message
 */
#define    tmos_msg_receive  ((  uint8_t*  (*)  ( tmosTaskID taskID ))  BLE_LIB_JT(14))

/**
 * @brief   allocate buffer for msg when need to send msg
 *
 * @param   len  - length of msg
 *
 * @return  pointer to allocated buffer or NULL if allocation failed.
 */
#define    tmos_msg_allocate  ((  uint8_t*  (*)  ( uint16_t len ))  BLE_LIB_JT(15))

/**
 * @brief   read a data item to NV.
 *
 * @param   id   - Valid NV item Id.
 * @param   len  - Length of data to read.
 * @param  *pBuf - Data to read.
 *
 * @return  SUCCESS if successful, NV_OPER_FAILED if failed.
 */
#define    tmos_snv_read  ((  bStatus_t  (*)  ( uint8_t id, uint8_t len, void *pBuf))  BLE_LIB_JT(107) )

/**
 * @brief   tmos system timer initialization
 *
 * @note    must initialization before call tmos task
 *
 * @param   fnGetClock - 0:system clock select RTC timer
 *                   valid:system clock select extend input
 *
 * @return  SUCCESS if successful, FAILURE if failed.
 */
#define    TMOS_TimerInit  ((  bStatus_t (*)  ( pfnGetSysClock fnGetClock ))  BLE_LIB_JT(16))

/**
 * @brief   Process system
 *
 * @param   None.
 *
 * @return  None.
 */
#define    TMOS_SystemProcess  ((  void  (*)  ( void ))  BLE_LIB_RAM_JT(0))

/**
 * @brief   Get current system clock
 *
 * @param   None.
 *
 * @return  current system clock (in 0.625ms)
 */
#define    TMOS_GetSystemClock  ((  uint32_t    (*)  ( void ))  BLE_LIB_JT(18))

/**
 * @brief   register process event callback function
 *
 * @param   eventCb-events callback function
 *
 * @return  0xFF - error,others-task id
 */
#define    TMOS_ProcessEventRegister  ((  tmosTaskID (*)  ( pTaskEventHandlerFn eventCb ))  BLE_LIB_JT(19))

/**
 * @brief   set LSE calibration value
 *
 * @param   flash_val - the value of flash
 * @param   ram_val - the value of ram
 *
 * @return  None.
 */
#define    TMOS_Set32KTuneValue  ((  void  (*)  ( uint16_t flash_val, uint16_t ram_val ))  BLE_LIB_JT(120) )

/**
 * @brief   Add a device address into white list ( support SNVNum MAX )
 *
 * @param   addrType - Type of device address
 * @param   devAddr  - first address of device address
 *
 * @return  Command Status.
 */
#define    LL_AddWhiteListDevice  ((  bStatus_t  (*)  ( uint8_t addrType, uint8_t *devAddr ))  BLE_LIB_JT(20))

/**
 * @brief   Remove a device address from white list
 *
 * @param   addrType - Type of device address
 * @param   devAddr  - first address of device address
 *
 * @return  Command Status.
 */
#define    LL_RemoveWhiteListDevice  ((  bStatus_t  (*)  ( uint8_t addrType, uint8_t *devAddr ))  BLE_LIB_JT(21))

/**
 * @brief   Clear white list
 *
 * @param   None
 *
 * @return  Command Status.
 */
#define    LL_ClearWhiteList  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(22))

/**
 * @brief   Encrypt data
 *
 * @param   key - key
 * @param   plaintextData - original data
 * @param   encryptData - encrypted data
 *
 * @return  Command Status.
 */
#define    LL_Encrypt  ((  bStatus_t  (*)  ( uint8_t *key, uint8_t *plaintextData, uint8_t *encryptData ))  BLE_LIB_JT(23))

/**
 * @brief   Decrypt data
 *
 * @param   key - key
 * @param   plaintextData - original data
 * @param   decryptData - decrypted data
 *
 * @return  Command Status.
 */
#define    LL_Decrypt  ((  bStatus_t  (*)  ( uint8_t *key, uint8_t *plaintextData, uint8_t *decryptData ))  BLE_LIB_JT(24))

/**
 * @brief   get number of unAck packet in current connect buffer
 *
 * @param   handle - connect handle
 *
 * @return  0xFFFFFFFF-handle error,number of packets not receiving ack 
 */
#define    LL_GetNumberOfUnAckPacket  ((  uint32_t  (*)  ( uint16_t handle ))  BLE_LIB_JT(25))

/**
 * @brief   Register a callback function will be called after each connect event.
 *          Only effect in single connection
 *
 * @param   connEventCB - callback function
 *
 * @return  None.
 */
#define    LL_ConnectEventRegister  ((  void  (*)  ( pfnEventCB connEventCB ))  BLE_LIB_JT(26))

/**
 * @brief   Register a callback function will be called after each advertise event.
 *
 * @param   advEventCB - callback function
 *
 * @return  None.
 */
#define   LL_AdvertiseEventRegister ((  void  (*) ( pfnEventCB advEventCB ))  BLE_LIB_JT(128))

/**
 * @brief   set tx power level
 *
 * @param   power - tx power level
 *
 * @return  Command Status.
 */
#define    LL_SetTxPowerLevel  ((  bStatus_t  (*)  ( uint8_t power ))  BLE_LIB_JT(27))

/**
 * @brief   read rssi
 *
 * @param   None.
 *
 * @return  the value of rssi.
 */
#define    BLE_ReadRssi  ((  int8_t  (*)  ( void ))  BLE_LIB_JT(108) )

/**
 * @brief   read cfo
 *
 * @param   None.
 *
 * @return  the value of cfo.
 */
#define    BLE_ReadCfo ((  int16_t (*) ( void )) BLE_LIB_JT(121) )

/**
 * @brief   pa control init
 *          
 * @note    Can't be called until  role Init
 *
 * @param   paControl - pa control parameters(global variable)
 *
 * @return  Command Status.
 */
#define    BLE_PAControlInit  ((  void   (*)  ( blePaControlConfig_t *paControl ))  BLE_LIB_JT(109) )

/**
 * @brief   ble register reset and rf calibration 
 *
 * @param   None 
 *
 * @return  None
 */
#define    BLE_RegInit  ((  void   (*)  ( void ))  BLE_LIB_JT(110) )

/**
 * @brief   Init BLE lib. RTC will be occupied at the same time.
 *
 * @param   pCfg - config of BLE lib
 *
 * @return  0-success. error defined @ ERR_LIB_INIT
 */
#define    BLE_LibInit  ((  bStatus_t  (*)  ( bleConfig_t* pCfg ))  BLE_LIB_JT(28))

/**
 * @brief   interrupt handler.
 *
 * @param   None
 *
 * @return  None
 */
#define   BB_IRQLibHandler  ((  void  (*) ( void )) BLE_LIB_JT(130) )

/**
 * @brief   interrupt handler.
 *
 * @param   None
 *
 * @return  None
 */
#define   LLE_IRQLibHandler ((  void  (*) ( void )) BLE_LIB_JT(131) )

/**
 * @brief   generate a valid access address
 *
 * @param   None.
 *
 * @return  access address
 * the Access Address meets the following requirements:
 * It shall have no more than six consecutive zeros or ones. 
 * It shall not be t he advertising channel packets�� Access Address.
 * It shall not be a sequence that differ s from the advertising channel packets' Access Address by only one bit.
 * It shall not have all four octets equal.
 * It shall have no more  than 24 transitions.
 * It shall have a minimum of two transitions in the most significant six bits.
 */
#define    BLE_AccessAddressGenerate  ((  void  (*)  ( void ))  BLE_LIB_JT(29))

