DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BLE_ROM.h
/*-------------------------------------------------------------------
 * FUNCTIONS - OBSERVER_PROFILE_API Observer Profile API
 */
/**
 * @internal
 *
 * @brief   Observer Profile Task initialization function.
 *
 * @param   taskId - Task ID.
 *
 * @return  SUCCESS,bleInvalidRange
 */
#define    GAPRole_ObserverInit  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(87) )

/**
 * @brief   Start the device in Observer role.  This function is typically
 *          called once during system startup.
 *
 * @param   pAppCallbacks - pointer to application callbacks
 *
 * @return  SUCCESS: Operation successful.<BR>
 *          bleAlreadyInRequestedMode: Device already started.<BR>
 */
#define    GAPRole_ObserverStartDevice  ((  bStatus_t  (*)  ( gapRoleObserverCB_t *pAppCallbacks ))  BLE_LIB_JT(88) )

/**
 * @brief   Start a device discovery scan.
 *
 * @param   mode - discovery mode: @ref GAP_DEVDISC_MODE_DEFINES
 * @param   activeScan - TRUE to perform active scan
 * @param   whiteList - TRUE to only scan for devices in the white list
 *
 * @return  SUCCESS: Discovery scan started.<BR>
 *          bleIncorrectMode: Invalid profile role.<BR>
 *          bleAlreadyInRequestedMode: Not available.<BR>
 */
#define    GAPRole_ObserverStartDiscovery  ((  bStatus_t  (*)  ( uint8_t mode, uint8_t activeScan, uint8_t whiteList ))  BLE_LIB_JT(89) )

/**
 * @brief   Cancel a device discovery scan.
 *
 * @return  SUCCESS: Cancel started.<BR>
 *          bleInvalidTaskID: Not the task that started discovery.<BR>
 *          bleIncorrectMode: Not in discovery mode.<BR>
 */
#define    GAPRole_ObserverCancelDiscovery  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(90) )

/*-------------------------------------------------------------------
 * FUNCTIONS - PERIPHERAL_PROFILE_API Peripheral Profile API
 */
/**
 * @internal
 *
 * @brief   Initialization function for the GAP Role Task.
 *          This is called during initialization and should contain
 *          any application specific initialization (ie. hardware
 *          initialization/setup, table initialization, power up
 *          notificaiton ... ).
 *
 * @param   the ID assigned by tmos.This ID should be used to send messages and set timers.
 *
 * @return  SUCCESS,bleInvalidRange
 */
#define    GAPRole_PeripheralInit  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(91) )

/**
 * @brief   Does the device initialization.  Only call this function once.
 *
 * @param   pAppCallbacks - pointer to application callbacks.
 *
 * @return  SUCCESS or bleAlreadyInRequestedMode
 */
#define    GAPRole_PeripheralStartDevice  ((  bStatus_t  (*)  ( uint8_t taskid, gapBondCBs_t *pCB,gapRolesCBs_t *pAppCallbacks ))  BLE_LIB_JT(92) )

/**
 * @brief   Update the parameters of an existing connection
 *
 * @param   connHandle - the connection Handle
 * @param   connIntervalMin - minimum connection interval in 1.25ms units
 * @param   connIntervalMax - maximum connection interval in 1.25ms units
 * @param   latency - the new slave latency
 * @param   connTimeout - the new timeout value
 * @param   taskId - taskID will recv L2CAP_SIGNAL_EVENT message
 *
 * @return  SUCCESS, bleNotConnected or bleInvalidRange
 */
#define    GAPRole_PeripheralConnParamUpdateReq  ((  bStatus_t  (*)  ( uint16_t connHandle, uint16_t connIntervalMin,\
    uint16_t connIntervalMax,uint16_t latency, uint16_t connTimeout,uint8_t taskId ))  BLE_LIB_JT(93) )

/*-------------------------------------------------------------------
 * FUNCTIONS - CENTRAL_PROFILE_API Central Profile API
 */
/**
 * @internal
 *
 * @brief   Central Profile Task initialization function.
 *
 * @param   taskId - Task ID.
 *
 * @return  SUCCESS,bleInvalidRange
 */
#define    GAPRole_CentralInit  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(94) )

/**
 * @brief   Start the device in Central role.  This function is typically
 *          called once during system startup.
 *
 * @param   pAppCallbacks - pointer to application callbacks
 *
 * @return  SUCCESS: Operation successful.<BR>
 *          bleAlreadyInRequestedMode: Device already started.<BR>
 */
#define    GAPRole_CentralStartDevice  ((  bStatus_t  (*)  ( uint8_t taskid, gapBondCBs_t *pCB, gapCentralRoleCB_t *pAppCallbacks ))  BLE_LIB_JT(95) )

/**
 * @brief   Start a device discovery scan.
 *
 * @param   mode - discovery mode: @ref GAP_DEVDISC_MODE_DEFINES
 * @param   activeScan - TRUE to perform active scan
 * @param   whiteList - TRUE to only scan for devices in the white list
 *
 * @return  SUCCESS: Discovery scan started.<BR>
 *          bleIncorrectMode: Invalid profile role.<BR>
 *          bleAlreadyInRequestedMode: Not available.<BR>
 */
#define    GAPRole_CentralStartDiscovery  ((  bStatus_t  (*)  ( uint8_t mode, uint8_t activeScan, uint8_t whiteList ))  BLE_LIB_JT(96) )

/**
 * @brief   Cancel a device discovery scan.
 *
 * @return  SUCCESS: Cancel started.<BR>
 *          bleInvalidTaskID: Not the task that started discovery.<BR>
 *          bleIncorrectMode: Not in discovery mode.<BR>
 */
#define    GAPRole_CentralCancelDiscovery  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(97) )

/**
 * @brief   Establish a link to a peer device.
 *
 * @param   highDutyCycle -  TRUE to high duty cycle scan, FALSE if not
 * @param   whiteList - determines use of the white list: TRUE-enable
 * @param   addrTypePeer - address type of the peer device: @ref GAP_ADDR_TYPE_DEFINES
 * @param   peerAddr - peer device address
 *
 * @return  SUCCESS: started establish link process.<BR>
 *          bleIncorrectMode: invalid profile role.<BR>
 *          bleNotReady: a scan is in progress.<BR>
 *          bleAlreadyInRequestedMode: can't process now.<BR>
 *          bleNoResources: too many links.<BR>
 */
#define    GAPRole_CentralEstablishLink  ((  bStatus_t  (*)  ( uint8_t highDutyCycle, uint8_t whiteList,uint8_t addrTypePeer, uint8_t *peerAddr ))  BLE_LIB_JT(98) )

