DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BLE_ROM.h
/*-------------------------------------------------------------------
 * FUNCTIONS - RF_PHY Profile API
 */

/**
 * @brief   RF_PHY Profile Task initialization function.
 *
 * @param   None.
 *
 * @return  0 - success.
 */
#define    RF_RoleInit  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(99) )

/**
 * @brief   rf config.
 *
 * @param   pConfig - rf config parameters
 *
 * @return  0 - success.
 */
#define    RF_Config  ((  bStatus_t  (*)  ( rfConfig_t *pConfig ))  BLE_LIB_JT(100) )

/**
 * @brief   rx mode.
 *
 * @param   txBuf - rx mode tx data
 * @param   txLen - rx mode tx length(0-251)
 * @param   pktRxType - rx mode rx package type
 *                      broadcast type(0xFF):receive all matching types,
 *                      others:receive match type or broadcast type
 * @param   pktTxType - rx mode tx package type(auto mode)
 *                      broadcast type(0xFF):received by all matching types;
 *                      others:only received by matching type
 *
 * @return  0 - success.
 */
#define    RF_Rx  ((  bStatus_t  (*)  ( uint8_t *txBuf, uint8_t txLen, uint8_t pktRxType, uint8_t pktTxType ) )  BLE_LIB_JT(101) )

/**
 * @brief   tx mode.
 *
 * @param   txBuf - tx mode tx data
 * @param   txLen - tx mode tx length(0-251)
 * @param   pktTxType - tx mode tx package type
 *                      broadcast type(0xFF):received by all matching types;
 *                      others:only received by matching type
 * @param   pktRxType - tx mode rx package type(auto mode)
 *                      broadcast type(0xFF):receive all matching types,
 *                      others:receive match type or broadcast type
 *
 * @return  0 - success.
 */
#define    RF_Tx  ((  bStatus_t  (*)  ( uint8_t *txBuf, uint8_t txLen, uint8_t pktTxType, uint8_t pktRxType ) )  BLE_LIB_JT(102) )

/**
 * @brief   shut down,stop tx/rx mode.
 *
 * @param   None.
 *
 * @return  0 - success.
 */
#define    RF_Shut  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(103) )

/**
 * @brief   rf mode set radio channel/frequency.
 *
 * @param   channel.
 *
 * @return  0 - success.
 */
#define    RF_SetChannel  ((  void   (*)  ( uint32_t channel ))  BLE_LIB_JT(115) )

/**
 * @brief   shut down rf frequency hopping
 *
 * @param   None.
 *
 * @return  None.
 */
#define    RF_FrequencyHoppingShut  ((  void   (*)  ( void ))  BLE_LIB_JT(116) )

/**
 * @brief       
 *
 * @param   resendCount - Maximum count of sending HOP_TX pdu,0 = unlimited.
 *
 * @return  0 - success.
 */
#define    RF_FrequencyHoppingTx  ((  bStatus_t  (*)  ( uint8_t resendCount ))  BLE_LIB_JT(117) )

/**
 * @brief       
 *
 * @param   timeoutMS - Maximum time to wait for receiving HOP_TX pdu(Time = n * 1mSec),0 = unlimited.
 *
 * @return  0 - success.1-fail.2-LLEMode error(shall AUTO)
 */
#define    RF_FrequencyHoppingRx  ((  bStatus_t  (*)  ( uint32_t timeoutMS ))  BLE_LIB_JT(118) )

/**
 * @brief   Erase FH bonded device
 *
 * @param   None.
 *
 * @return  None.
 */
#define    RF_BondingErase  ((  void  (*)  ( void ))  BLE_LIB_JT(119) )

/**
 * @brief   single channel mode.
 *
 * @param   ch - rf channel,f=2402+ch*2 MHz, ch=0,...,39
 *
 * @return  0 - success.
 */
#define    LL_SingleChannel  ((  bStatus_t  (*)  ( uint8_t ch ))  BLE_LIB_JT(104) )

/**
 * @brief   used to stop any test which is in progress.
 *
 * @param(in)   pPktNum - null
 *
 * @param(out)  the number of received packets.
 *
 * @return  0 - success.
 */
#define    LL_TestEnd  ((  bStatus_t  (*)  (uint8_t *pPktNum ))  BLE_LIB_JT(105) )

/**
 * @brief   used to start a test where the DUT receives test reference packets at a fixed interval
 *
 * @param       rx_channel
 *
 * @return  0 - success.
 */
#define    API_LE_ReceiverTestCmd  ((  bStatus_t  (*)  ( uint8_t rx_channel ))  BLE_LIB_JT(111) )

/**
 * @brief   used to start a test where the DUT generates test reference packets at a fixed interval
 *
 * @param       tx_channel - RF channel(0-39)
 *              len        - test data length
 *              payload    - test data type
 *              tx_power   - tx power
 *
 * @return  0 - success.
 */
#define    API_LE_TransmitterTestCmd  ((  bStatus_t  (*)  ( uint8_t tx_channel, uint8_t len, uint8_t payload, uint8_t tx_power))  BLE_LIB_JT(112) )

/**
 * @brief   used to stop any test which is in progress
 *
 * @param   None
 *
 * @return  0 - success.
 */
#define    API_LE_TestEndCmd  ((  bStatus_t  (*)  ( void ))  BLE_LIB_JT(113) )

/**
 * @brief   used to set sensitivity level
 *
 * @param   None
 *
 * @return  None.
 */
#define   RFEND_SetSensitivity  ((  void  (*) ( void )) BLE_LIB_JT(122) )

/**
 * @brief   used to set rf TxCtune value
 *
 * @param   pParm(in) - Must provide length of parameter followed by 6 bytes parameter
 *
 * @return  Command Status.
 */
#define   RFEND_TXCtuneSet  ((  bStatus_t (*) ( uint8_t *pParm )) BLE_LIB_JT(123) )

/**
 * @brief   used to get rf TxCtune value
 *
 * @param   pParm(out) - length of parameter(6) followed by 6 bytes parameter
 *
 * @return  Command Status.
 */
#define   RFEND_TXCtuneGet  ((  bStatus_t (*) ( uint8_t *pParm )) BLE_LIB_JT(124) )

/**
 * @brief   used to set  RF-ADC calibration mode
 *
 * @param   mode = 0 basic mode
 *          mode = 1 auto mode
 *
 * @return  none.
 */
#define   RFEND_SetAdcMode  ((  void (*) ( uint8_t mode )) BLE_LIB_JT(125) )

/*
 * END @ Profile API
 */
/******************************************************************************/
#ifdef __cplusplus
}
#endif

#endif
